{"config": [{"config": {"batch_input_shape": [null, 60, 40, 1], "nb_row": 7, "subsample": [1, 1], "input_dtype": "float32", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_1", "activity_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 7, "nb_filter": 40, "activation": "relu", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"batch_input_shape": [null, 60, 40, 1], "nb_row": 5, "subsample": [1, 1], "input_dtype": "float32", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "activity_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 5, "nb_filter": 40, "activation": "relu", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 256, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"p": 0.75, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 2, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "activation": "softmax"}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}