{"config": [{"config": {"activation": "relu", "init": "glorot_uniform", "border_mode": "same", "nb_filter": 40, "subsample": [1, 1], "nb_col": 7, "batch_input_shape": [null, 32, 32, 1], "nb_row": 7, "name": "convolution2d_1", "b_regularizer": null, "trainable": true, "input_dtype": "float32", "bias": true, "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "init": "glorot_uniform", "border_mode": "same", "nb_filter": 40, "subsample": [1, 1], "nb_col": 5, "batch_input_shape": [null, 32, 32, 1], "nb_row": 5, "name": "convolution2d_2", "b_regularizer": null, "trainable": true, "input_dtype": "float32", "bias": true, "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "init": "glorot_uniform", "input_dim": null, "output_dim": 256, "name": "dense_1", "b_regularizer": null, "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "init": "glorot_uniform", "input_dim": null, "output_dim": 2, "name": "dense_2", "b_regularizer": null, "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}