{"keras_version": "1.1.2", "config": [{"config": {"init": "glorot_uniform", "W_constraint": null, "trainable": true, "nb_row": 7, "dim_ordering": "tf", "W_regularizer": null, "input_dtype": "float32", "name": "convolution2d_1", "b_constraint": null, "bias": true, "batch_input_shape": [null, 32, 32, 1], "activation": "relu", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 40, "nb_col": 7, "b_regularizer": null, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "trainable": true, "nb_row": 5, "dim_ordering": "tf", "W_regularizer": null, "input_dtype": "float32", "name": "convolution2d_2", "b_constraint": null, "bias": true, "batch_input_shape": [null, 32, 32, 1], "activation": "relu", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 40, "nb_col": 5, "b_regularizer": null, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "name": "dense_1", "activation": "relu", "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "output_dim": 256, "b_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "name": "dense_2", "activation": "softmax", "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "output_dim": 2, "b_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}