{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 60, 40, 1], "input_dtype": "float32", "nb_filter": 40, "b_constraint": null, "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "convolution2d_1", "nb_col": 7, "activity_regularizer": null, "subsample": [1, 1], "bias": true, "activation": "relu", "nb_row": 7, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 60, 40, 1], "input_dtype": "float32", "nb_filter": 40, "b_constraint": null, "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "convolution2d_2", "nb_col": 5, "activity_regularizer": null, "subsample": [1, 1], "bias": true, "activation": "relu", "nb_row": 5, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "name": "dense_1", "W_regularizer": null, "input_dim": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "activation": "relu", "output_dim": 256, "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.75, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "name": "dense_2", "W_regularizer": null, "input_dim": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "activation": "softmax", "output_dim": 2, "W_constraint": null}}], "keras_version": "1.1.2"}