{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "nb_col": 5, "nb_filter": 40, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "W_regularizer": null, "nb_row": 5, "name": "convolution2d_1", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "tf", "batch_input_shape": [null, 30, 20, 1], "bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "trainable": true, "activity_regularizer": null, "output_dim": 256, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "activation": "softmax", "W_constraint": null, "trainable": true, "activity_regularizer": null, "output_dim": 151, "bias": true}}]}