{"config": [{"config": {"subsample": [1, 1], "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "activation": "relu", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "nb_filter": 40, "batch_input_shape": [null, 30, 20, 1], "trainable": true, "input_dtype": "float32", "bias": true, "nb_row": 5, "nb_col": 5, "name": "convolution2d_1", "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 256, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "dense_1", "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"output_dim": 151, "activity_regularizer": null, "b_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "dense_2", "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}